app/controllers/api/task_lists_controller.rb

SELECT "task_lists".* FROM "task_lists"
---
  def index
    task_lists = TaskList.all

INSERT INTO "task_lists" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 24 Jun 2014 07:01:14 UTC +00:00], ["title", "first"], ["updated_at", Tue, 24 Jun 2014 07:01:14 UTC +00:00]]
---
  def create
    #list = current_user.task_lists.create!(safe_params)
    list = TaskList.create!(safe_params)

UPDATE "task_lists" SET "title" = ?, "updated_at" = ? WHERE "task_lists"."id" = 25  [["title", "first charethde"], ["updated_at", Wed, 25 Jun 2014 06:27:17 UTC +00:00]]
---
  def update
    task_list.update_attributes(safe_params)

DELETE FROM "task_lists" WHERE "task_lists"."id" = ?  [["id", 16]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]
---
  def destroy
    task_list.destroy